### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [72]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [75]:
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the overall passing rate (overall average score), i.e. (avg. math score + avg. reading score)/2

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [93]:
total_schools = school_data["school_name"].nunique()
total_students = school_data["size"].sum()
total_budget = school_data["budget"].sum()
average_math_score = student_data["math_score"].mean()
average_reading_score = student_data["reading_score"].mean()
math_passing_percent = ((student_data["math_score"].loc[student_data["math_score"] >= 70]).count() \
                        / student_data["Student ID"].count()) * 100
reading_passing_percent = ((student_data["reading_score"].loc[student_data["reading_score"] >= 70]).count() \
                        / student_data["Student ID"].count()) * 100
overall_passing_percent = (average_math_score + average_reading_score) / 2

In [94]:

district_summary = pd.DataFrame({"Total Schools": [total_schools],
                                "Total Students" : [total_students],
                                "Total Budget": [total_budget],
                                "Average Math Score": [average_math_score],
                                "Average Reading Score": [average_reading_score],
                                 "% Overall Passing" : overall_passing_percent,
                                "% Math Passing" : math_passing_percent,
                                "% Reading Passing": reading_passing_percent})
district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Overall Passing,% Math Passing,% Reading Passing
0,15,39170,24649428,78.985371,81.87784,80.431606,74.980853,85.805463

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)
  
* Create a dataframe to hold the above results

## Top Performing Schools (By Passing Rate)

* Sort and display the top five schools in overall passing rate

In [120]:
total_students

school_name
Bailey High School       4976
Cabrera High School      1858
Figueroa High School     2949
Ford High School         2739
Griffin High School      1468
Hernandez High School    4635
Holden High School        427
Huang High School        2917
Johnson High School      4761
Pena High School          962
Rodriguez High School    3999
Shelton High School      1761
Thomas High School       1635
Wilson High School       2283
Wright High School       1800
Name: size, dtype: int64

In [123]:
total_students = school_data.groupby("school_name")["size"].sum()
total_school_budget = school_data.groupby("school_name")["budget"].sum()
per_student_budget = total_school_budget / total_students
school_math_score = student_data.groupby("school_name")["math_score"].mean()
school_reading_score = student_data.groupby("school_name")["reading_score"].mean()
school_passing_math = student_data[["school_name","math_score"]].loc[student_data["math_score"] >= 70]\
                    .groupby("school_name").count()
school_passing_math2 = school_passing

                       math_score
school_name
Bailey High School           3318
Cabrera High School          1749
Figueroa High School         1946
Ford High School             1871
Griffin High School          1371
Hernandez High School        3094
Holden High School            395
Huang High School            1916
Johnson High School          3145
Pena High School              910
Rodriguez High School        2654
Shelton High School          1653
Thomas High School           1525
Wilson High School           2143
Wright High School           1680

In [117]:
school_summary = pd.DataFrame({"Total Students": total_students,
                               #"School Type": school_data["type"],
                              "Total School Budget":total_school_budget,
                              "Per Student Budget":per_student_budget,
                              "Average Math Score":school_math_score,
                              "Average Reading Score":school_reading_score}) 
                              #"% Passing Math":,
                              #"% Passing Reading":,
                              #"Overall Passing Rate":, }) 

school_summary

,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score
school_name,,,,,
Bailey High School,4976,3124928,628.0,77.048432,81.033963
Cabrera High School,1858,1081356,582.0,83.061895,83.975780
Figueroa High School,2949,1884411,639.0,76.711767,81.158020
Ford High School,2739,1763916,644.0,77.102592,80.746258
Griffin High School,1468,917500,625.0,83.351499,83.816757
Hernandez High School,4635,3022020,652.0,77.289752,80.934412
Holden High School,427,248087,581.0,83.803279,83.814988
Huang High School,2917,1910635,655.0,76.629414,81.182722
Johnson High School,4761,3094650,650.0,77.072464,80.966394
Pena High School,962,585858,609.0,83.839917,84.044699
Rodriguez High School,3999,2547363,637.0,76.842711,80.744686
Shelton High School,1761,1056600,600.0,83.359455,83.725724
Thomas High School,1635,1043130,638.0,83.418349,83.848930
Wilson High School,2283,1319574,578.0,83.274201,83.989488
Wright High School,1800,1049400,583.0,83.682222,83.955000

## Bottom Performing Schools (By Passing Rate)

* Sort and display the five worst-performing schools

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

## Reading Score by Grade

* Perform the same operations as above for reading scores

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

In [ ]:
# Sample bins. Feel free to create your own bins.
spending_bins = [0, 585, 615, 645, 675]
group_names = ["<$585", "$585-615", "$615-645", "$645-675"]

## Scores by School Size

* Perform the same operations as above, based on school size.

In [ ]:
# Sample bins. Feel free to create your own bins.
size_bins = [0, 1000, 2000, 5000]
group_names = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]

## Scores by School Type

* Perform the same operations as above, based on school type.